[
  {
    "Id": "233243",
    "ThreadId": "68560",
    "Html": "<p>Is it possible to zoom in/out on each y-axis separatly. i.e Hover over the left axis and use the mouse wheel to zoom in out on that axis only. Hover over the right axis and use the mouse wheel to zoom in and out on that axis only.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks,</p>\r\n<p>Kelly</p>\r\n<p>&nbsp;</p>\r\n<p>P.S. Im working on a repro for that line graph removal bug, but I'm not going slow since I used a work around.&nbsp;</p>",
    "PostedDate": "2009-09-10T11:29:03.753-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233248",
    "ThreadId": "68560",
    "Html": "<p>Hi Kelly,</p>\r\n<p>Yes, it is possible to zoom in/out on every axis separately - and certainly in the way you've described. Also you can zoom in or out with right mouse button pressed, moving mouse along the axis.</p>\r\n<p>Best regards,</p>\r\n<p>Mikhail.</p>",
    "PostedDate": "2009-09-10T11:35:04.007-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233263",
    "ThreadId": "68560",
    "Html": "<p>For me, the left axis is controlling both the left and the right zoom.</p>\r\n<p>UPDATE:</p>\r\n<p><span style=\"white-space:pre\"> </span>Im not sure if im being completely clear here. When I hover over the left axis and move the mouse wheel, I would like the left axis min and max to change but the right axis max/min to stay constant. So zooming on the left axis should only zoom in on data in the mainplotter. Zooming on the right axis should only zoom in on data in the innerplotter.</p>\r\n<p>Is there a sample I can follow to achieve separate scrolling? Currently I am following the TwoIndependentAxes sample which behaves like mine.</p>\r\n<p>&nbsp;</p>\r\n<p>Thanks for your time.</p>",
    "PostedDate": "2009-09-10T11:57:47.017-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  },
  {
    "Id": "233459",
    "ThreadId": "68560",
    "Html": "<p>Hi Kelly,</p>\r\n<p>Currently InjectedPlotter sets a two-way binging on its Viewport.Visible property and its parent plotter's Viewport.Visible, that's why axes are moving together when you are panning or zooming only one of them.</p>\r\n<p>In the next changeset, which will be uploaded to 'Source code' page, there will be a boolean SetViewportBinding property of InjectedPlotter, which wil allow you to control whether to set such two=way binding, or not.</p>\r\n<p>Best regards,</p>\r\n<p>Mikhail.</p>",
    "PostedDate": "2009-09-11T01:12:56.523-07:00",
    "UserRole": null,
    "MarkedAsAnswerDate": null
  }
]